TexasInstruments/mspm0-sdk/source/ti/devices/msp/m0p/mspm0g121x.h
/* IOMUX_PINCM7[PF] Bits */
#define IOMUX_PINCM7_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM7_PF_GPIOA_DIO02                   ((uint32_t)0X00000001)
#define IOMUX_PINCM7_PF_TIMG8_CCP1                    ((uint32_t)0X00000002)
#define IOMUX_PINCM7_PF_UC2_CS0                       ((uint32_t)0X00000003)
#define IOMUX_PINCM7_PF_UC4_CS0                       ((uint32_t)0X00000005)
#define IOMUX_PINCM7_PF_UC4_CTS                       ((uint32_t)0X00000005)
#define IOMUX_PINCM7_PF_TIMA0_CCP3_CMPL               ((uint32_t)0X00000006)
#define IOMUX_PINCM7_PF_TIMA0_CCP2_CMPL               ((uint32_t)0X00000007)
#define IOMUX_PINCM7_PF_TIMA_FAULT0                   ((uint32_t)0X00000008)
#define IOMUX_PINCM7_PF_TIMA_FAULT1                   ((uint32_t)0X00000009)
#define IOMUX_PINCM7_PF_TIMA0_CCP0                    ((uint32_t)0X0000000B)

/* IOMUX_PINCM8[PF] Bits */
#define IOMUX_PINCM8_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM8_PF_GPIOA_DIO03                   ((uint32_t)0X00000001)
#define IOMUX_PINCM8_PF_TIMG8_CCP0                    ((uint32_t)0X00000002)
#define IOMUX_PINCM8_PF_UC2_CS1                       ((uint32_t)0X00000003)
#define IOMUX_PINCM8_PF_UC5_SDA                       ((uint32_t)0X00000004)
#define IOMUX_PINCM8_PF_UC5_TX                        ((uint32_t)0X00000004)
#define IOMUX_PINCM8_PF_TIMA0_CCP1                    ((uint32_t)0X00000005)
#define IOMUX_PINCM8_PF_COMP0_OUT                     ((uint32_t)0X00000006)
#define IOMUX_PINCM8_PF_TIMA0_CCP2                    ((uint32_t)0X00000008)
#define IOMUX_PINCM8_PF_UC0_CTS                       ((uint32_t)0X00000009)
#define IOMUX_PINCM8_PF_UC2_CS3                       ((uint32_t)0X0000000B)
#define IOMUX_PINCM8_PF_COMP1_OUT                     ((uint32_t)0X0000000C)

/* IOMUX_PINCM9[PF] Bits */
#define IOMUX_PINCM9_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM9_PF_GPIOA_DIO04                   ((uint32_t)0X00000001)
#define IOMUX_PINCM9_PF_TIMG8_CCP1                    ((uint32_t)0X00000002)
#define IOMUX_PINCM9_PF_UC2_POCI                      ((uint32_t)0X00000003)
#define IOMUX_PINCM9_PF_UC5_SCL                       ((uint32_t)0X00000004)
#define IOMUX_PINCM9_PF_UC5_RX                        ((uint32_t)0X00000004)
#define IOMUX_PINCM9_PF_TIMA0_CCP1_CMPL               ((uint32_t)0X00000005)
#define IOMUX_PINCM9_PF_SYSCTL_LFCLKIN                ((uint32_t)0X00000006)
#define IOMUX_PINCM9_PF_TIMA0_CCP3                    ((uint32_t)0X00000008)
#define IOMUX_PINCM9_PF_UC0_RTS                       ((uint32_t)0X00000009)
#define IOMUX_PINCM9_PF_UC2_CS0                       ((uint32_t)0X0000000B)

/* IOMUX_PINCM10[PF] Bits */
#define IOMUX_PINCM10_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM10_PF_GPIOA_DIO05                  ((uint32_t)0X00000001)
#define IOMUX_PINCM10_PF_TIMG8_CCP0                   ((uint32_t)0X00000002)
#define IOMUX_PINCM10_PF_UC2_PICO                     ((uint32_t)0X00000003)
#define IOMUX_PINCM10_PF_UC5_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM10_PF_UC5_TX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM10_PF_TIMG0_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM10_PF_SYSCTL_FCC_IN                ((uint32_t)0X00000006)
#define IOMUX_PINCM10_PF_TIMA_FAULT1                  ((uint32_t)0X00000008)
#define IOMUX_PINCM10_PF_UC4_CS0                      ((uint32_t)0X00000009)
#define IOMUX_PINCM10_PF_UC4_CTS                      ((uint32_t)0X00000009)

/* IOMUX_PINCM11[PF] Bits */
#define IOMUX_PINCM11_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM11_PF_GPIOA_DIO06                  ((uint32_t)0X00000001)
#define IOMUX_PINCM11_PF_TIMG8_CCP1                   ((uint32_t)0X00000002)
#define IOMUX_PINCM11_PF_UC2_SCLK                     ((uint32_t)0X00000003)
#define IOMUX_PINCM11_PF_UC5_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM11_PF_UC5_RX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM11_PF_TIMG0_CCP1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM11_PF_SYSCTL_HFCLKIN               ((uint32_t)0X00000006)
#define IOMUX_PINCM11_PF_TIMA_FAULT0                  ((uint32_t)0X00000008)
#define IOMUX_PINCM11_PF_UC4_POCI                     ((uint32_t)0X00000009)
#define IOMUX_PINCM11_PF_UC4_RTS                      ((uint32_t)0X00000009)
#define IOMUX_PINCM11_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X0000000A)

/* IOMUX_PINCM12[PF] Bits */
#define IOMUX_PINCM12_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM12_PF_GPIOB_DIO00                  ((uint32_t)0X00000001)
#define IOMUX_PINCM12_PF_UC4_PICO                     ((uint32_t)0X00000002)
#define IOMUX_PINCM12_PF_UC4_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM12_PF_UC0_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM12_PF_UC0_RX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM12_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM12_PF_TIMG0_CCP0                   ((uint32_t)0X00000006)
#define IOMUX_PINCM12_PF_UC2_CS3                      ((uint32_t)0X00000007)
#define IOMUX_PINCM12_PF_TIMA1_CCP0                   ((uint32_t)0X00000008)

/* IOMUX_PINCM13[PF] Bits */
#define IOMUX_PINCM13_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM13_PF_GPIOB_DIO01                  ((uint32_t)0X00000001)
#define IOMUX_PINCM13_PF_UC4_SCLK                     ((uint32_t)0X00000002)
#define IOMUX_PINCM13_PF_UC4_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM13_PF_UC0_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM13_PF_UC0_TX                       ((uint32_t)0X00000004)
#define IOMUX_PINCM13_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM13_PF_TIMG0_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM13_PF_UC2_CS2                      ((uint32_t)0X00000007)
#define IOMUX_PINCM13_PF_TIMA1_CCP1                   ((uint32_t)0X00000008)

